package com.example.astronicalhandbook.data

object NewsRepository {
    val newsList = listOf(
        News(1, "Новая Звезда", "Астрономы нашли новую яркую звезду.", 241),
        News(2, "Марсоход", "Марсоход прислал потрясающие фото.", 852),
        News(3, "Солнечная Вспышка", "Ожидается северное сияние.", 120),
        News(4, "Столкновение Галактик", "Млечный Путь на курсе столкновения.", 567),
        News(5, "Черная Дыра", "Первое прямое изображение черной дыры.", 999),
        News(6, "Комета", "Комета Галлея пока далеко.", 34),
        News(7, "Запуск SpaceX", "Еще одна успешная посадка.", 456),
        News(8, "Лунная База", "НАСА раскрыло концепт лунной базы.", 789),
        News(9, "Сигналы", "Обнаружен радиосигнал из космоса.", 111),
        News(10, "Астероид", "Земля снова в безопасности.", 222)
    )
}
